
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/10813016214)



<pre><code>Apply complete! Resources: 4 added, 3 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-add-demo-page-again/runs/run-kYaw6fWtYbmZcch2

Waiting for the plan to start...

Terraform v1.9.5
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=2ada4151693f1acad125a1a8fd09398912ad8f31]
data.aws_caller_identity.current: Reading...
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=mtchoun-mouh-add-demo-page-again-trigger_user_scan]
aws_s3_bucket_object.example_file: Refreshing state... [id=index.html]
data.aws_iam_role.role: Reading...
aws_dynamodb_table.Users: Refreshing state... [id=mtchoun-mouh-add-demo-page-again-Users]
aws_dynamodb_table.Register: Refreshing state... [id=mtchoun-mouh-add-demo-page-again-Register]
aws_lambda_layer_version.test_lambda_layer: Refreshing state... [id=arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:8]
aws_s3_bucket.website: Refreshing state... [id=mtchoun-mouh-add-demo-page-again-mtchoun-mouh.mongulu.cm]
aws_dynamodb_table.Link_table: Refreshing state... [id=mtchoun-mouh-add-demo-page-again-Link_table]
aws_s3_bucket.images: Refreshing state... [id=mtchoun-mouh-add-demo-page-again-djansang]
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
aws_api_gateway_rest_api.api: Refreshing state... [id=z8tkl1p2bi]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]
aws_lambda_function.scan: Refreshing state... [id=mtchoun-mouh-add-demo-page-again-scan_user_consulcam]
aws_lambda_function.lambda: Refreshing state... [id=mtchoun-mouh-add-demo-page-again-user_registration_consulcam]
aws_api_gateway_resource.resource: Refreshing state... [id=nkjsmo]
aws_api_gateway_method.method: Refreshing state... [id=agm-z8tkl1p2bi-nkjsmo-POST]
module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-z8tkl1p2bi-nkjsmo-OPTIONS]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.target: Refreshing state... [id=mtchoun-mouh-add-demo-page-again-trigger_user_scan-lambda]
module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-z8tkl1p2bi-nkjsmo-OPTIONS]
module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-z8tkl1p2bi-nkjsmo-OPTIONS-200]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-z8tkl1p2bi-nkjsmo-POST-200]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-z8tkl1p2bi-nkjsmo-POST]
module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-z8tkl1p2bi-nkjsmo-OPTIONS-200]
aws_api_gateway_deployment.test: Refreshing state... [id=sn0542]
local_file.demo_page: Refreshing state... [id=d0871231c2d53b36ac00ec30dc453f3866a44d4c]
local_file.index_page: Refreshing state... [id=8b382bcbb2ec74d2beda1c85ee5feb17a355c26d]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=mtchoun-mouh-add-demo-page-again-mtchoun-mouh.mongulu.cm]
aws_s3_bucket_policy.website: Refreshing state... [id=mtchoun-mouh-add-demo-page-again-mtchoun-mouh.mongulu.cm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_dynamodb_table.Link_table will be updated in-place
  ~ resource "aws_dynamodb_table" "Link_table" {
        id               = "mtchoun-mouh-add-demo-page-again-Link_table"
        name             = "mtchoun-mouh-add-demo-page-again-Link_table"
      ~ read_capacity    = 0 -> 3
        tags             = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
      ~ write_capacity   = 0 -> 1
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "mtchoun-mouh-add-demo-page-again-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (11 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh-add-demo-page-again-mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (13 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.demo_page will be created
  + resource "aws_s3_bucket_object" "demo_page" {
      + acl                    = "private"
      + bucket                 = "mtchoun-mouh-add-demo-page-again-mtchoun-mouh.mongulu.cm"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "demo.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../html/demo.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.example_file will be destroyed
  # (because aws_s3_bucket_object.example_file is not in configuration)
  - resource "aws_s3_bucket_object" "example_file" {
      - acl                           = "private" -> null
      - bucket                        = "mtchoun-mouh-add-demo-page-again-mtchoun-mouh.mongulu.cm" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "text/html" -> null
      - etag                          = "5d15ee752f1eb22f2f94ae4109d23547" -> null
      - force_destroy                 = false -> null
      - id                            = "index.html" -> null
      - key                           = "index.html" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "../html/index.html" -> null
      - storage_class                 = "STANDARD" -> null
      - tags_all                      = {} -> null
        # (9 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.index_page will be created
  + resource "aws_s3_bucket_object" "index_page" {
      + acl                    = "private"
      + bucket                 = "mtchoun-mouh-add-demo-page-again-mtchoun-mouh.mongulu.cm"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../html/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # local_file.demo_page will be created
  + resource "local_file" "demo_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/demo.html"
      + id                   = (known after apply)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

Plan: 4 to add, 3 to change, 1 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 6 estimated
           $1.872/mo +$0.7488

------------------------------------------------------------------------

aws_s3_bucket_object.example_file: Destroying... [id=index.html]
aws_dynamodb_table.Link_table: Modifying... [id=mtchoun-mouh-add-demo-page-again-Link_table]
aws_s3_bucket.images: Modifying... [id=mtchoun-mouh-add-demo-page-again-djansang]
local_file.demo_page: Creating...
local_file.demo_page: Creation complete after 0s [id=d0871231c2d53b36ac00ec30dc453f3866a44d4c]
aws_s3_bucket_object.example_file: Destruction complete after 0s
local_file.index_page: Creating...
aws_s3_bucket.website: Modifying... [id=mtchoun-mouh-add-demo-page-again-mtchoun-mouh.mongulu.cm]
local_file.index_page: Creation complete after 0s [id=8b382bcbb2ec74d2beda1c85ee5feb17a355c26d]
aws_dynamodb_table.Link_table: Modifications complete after 1s [id=mtchoun-mouh-add-demo-page-again-Link_table]
aws_s3_bucket.images: Modifications complete after 5s [id=mtchoun-mouh-add-demo-page-again-djansang]
aws_s3_bucket.website: Modifications complete after 6s [id=mtchoun-mouh-add-demo-page-again-mtchoun-mouh.mongulu.cm]
aws_s3_bucket_object.index_page: Creating...
aws_s3_bucket_object.demo_page: Creating...
aws_s3_bucket_object.index_page: Creation complete after 1s [id=index.html]
aws_s3_bucket_object.demo_page: Creation complete after 1s [id=demo.html]

Apply complete! Resources: 4 added, 3 changed, 1 destroyed.

Outputs:

register_table = "mtchoun-mouh-add-demo-page-again-Register"
stage_url = "https://z8tkl1p2bi.execute-api.eu-central-1.amazonaws.com/mtchoun-mouh-add-demo-page-again-dev"
website_url = "http://mtchoun-mouh-add-demo-page-again-mtchoun-mouh.mongulu.cm.s3-website.eu-central-1.amazonaws.com"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":196,"Program":"tfcmt","SHA1":"7dabd8548ef9deb68316f87d31c2391dbb123068","Vars":{},"WorkflowName":"Deploy cases"} -->